matthewpanizza/SolarPack-MPPT/HV_SOLAR_DC_DC/device_support/f2806x/v151/F2806x_examples_ccsv5/usb_dev_serial/usb_dev_serial.c
    }
    else if(ui32Ints & UART_INT_RXERR)
    {
        //
        //Notify Host of our error
        //
        CheckForSerialStateChange(&g_sCDCDevice, UARTRxErrorGet(UART0_BASE));

        //
        //Clear the error and continue
        //
        UARTRxErrorClear(UART0_BASE);
    }

    PieCtrlRegs.PIEACK.bit.ACK9 = 1;

}

//*****************************************************************************
//
// Set the communication parameters to use on the UART.
//
//*****************************************************************************
static tBoolean
SetLineCoding(tLineCoding *psLineCoding)
{
    uint32_t ui32Config;
    tBoolean bRetcode;

    //
    // Assume everything is OK until a problem is detected.
    //
    bRetcode = true;

    //
    // Word length.  For invalid values, the default is to set 8 bits per
    // character and return an error.
    //
    switch(psLineCoding->ui8Databits)
    {
    case 5:
    {
        ui32Config = UART_CONFIG_WLEN_5;
        break;
    }

    case 6:
    {
        ui32Config = UART_CONFIG_WLEN_6;
        break;
    }

    case 7:
    {
        ui32Config = UART_CONFIG_WLEN_7;
        break;
    }

    case 8:
    {
        ui32Config = UART_CONFIG_WLEN_8;
        break;
    }

    default:
    {
        ui32Config = UART_CONFIG_WLEN_8;
        bRetcode = false;
        break;
    }
    }

    //
    // Parity.  For any invalid values, set no parity and return an error.
    //
    switch(psLineCoding->ui8Parity)
    {
    case USB_CDC_PARITY_NONE:
    {
        ui32Config |= UART_CONFIG_PAR_NONE;
        break;
    }

    case USB_CDC_PARITY_ODD:
    {
        ui32Config |= UART_CONFIG_PAR_ODD;
        break;
    }

    case USB_CDC_PARITY_EVEN:
    {
        ui32Config |= UART_CONFIG_PAR_EVEN;
        break;
    }

    default:
    {
        ui32Config |= UART_CONFIG_PAR_NONE;
        bRetcode = false;
        break;
    }
    }

    //
    // Stop bits.  The hardware only supports 1 or 2 stop bits whereas CDC
    // allows the host to select 1.5 stop bits.  If passed 1.5 (or any other
    // invalid or unsupported value of ucStop, set up for 1 stop bit but return
    // an error in case the caller needs to Stall or otherwise report this back
    // to the host.
    //
    switch(psLineCoding->ui8Stop)
    {
        //
        // One stop bit requested.
        //
    case USB_CDC_STOP_BITS_1:
    {
        ui32Config |= UART_CONFIG_STOP_ONE;
        break;
    }

    //
    // Two stop bits requested.
    //
    case USB_CDC_STOP_BITS_2:
    {
        ui32Config |= UART_CONFIG_STOP_TWO;
        break;
    }

    //
    // Other cases are either invalid values of ucStop or values that are
    // not supported, so set 1 stop bit but return an error.
    //
    default:
    {
        ui32Config = UART_CONFIG_STOP_ONE;
        bRetcode = false;
        break;
    }
    }

    //
    // Set the UART mode appropriately.
    //
    UARTConfigSetExpClk(UART0_BASE, SysCtlClockGet(SYSTEM_CLOCK_SPEED)/4,
    		            readusb32_t(&(psLineCoding->ui32Rate)), ui32Config);

    //
    // Let the caller know if a problem was encountered.
    //
    return(bRetcode);
}

//*****************************************************************************
//
// Get the communication parameters in use on the UART.
//
//*****************************************************************************
static void
GetLineCoding(tLineCoding *psLineCoding)
{
    uint32_t ui32Config;
    uint32_t ui32Rate;

    //
    // Get the current line coding set in the UART.
    //
    UARTConfigGetExpClk(UART0_BASE, SysCtlClockGet(SYSTEM_CLOCK_SPEED)/4, &ui32Rate,
                        &ui32Config);
    writeusb32_t(&(psLineCoding->ui32Rate), ui32Rate);

    //
    // Translate the configuration word length field into the format expected
    // by the host.
    //
    switch(ui32Config & UART_CONFIG_WLEN_MASK)
    {
    case UART_CONFIG_WLEN_8:
    {
        psLineCoding->ui8Databits = 8;
        break;
    }

    case UART_CONFIG_WLEN_7:
    {
        psLineCoding->ui8Databits = 7;
        break;
    }

    case UART_CONFIG_WLEN_6:
    {
        psLineCoding->ui8Databits = 6;
        break;
    }

    case UART_CONFIG_WLEN_5:
    {
        psLineCoding->ui8Databits = 5;
        break;
    }
    }

    //
    // Translate the configuration parity field into the format expected
    // by the host.
    //
    switch(ui32Config & UART_CONFIG_PAR_MASK)
    {
    case UART_CONFIG_PAR_NONE:
    {
        psLineCoding->ui8Parity = USB_CDC_PARITY_NONE;
        break;
    }

    case UART_CONFIG_PAR_ODD:
    {
        psLineCoding->ui8Parity = USB_CDC_PARITY_ODD;
        break;
    }

    case UART_CONFIG_PAR_EVEN:
    {
        psLineCoding->ui8Parity = USB_CDC_PARITY_EVEN;
        break;
    }

    }

    //
    // Translate the configuration stop bits field into the format expected
    // by the host.
    //
    switch(ui32Config & UART_CONFIG_STOP_MASK)
    {
    case UART_CONFIG_STOP_ONE:
    {
        psLineCoding->ui8Stop = USB_CDC_STOP_BITS_1;
        break;
    }

    case UART_CONFIG_STOP_TWO:
    {
        psLineCoding->ui8Stop = USB_CDC_STOP_BITS_2;
        break;
    }
    }
}

//*****************************************************************************
//
// This function sets or clears a break condition on the redirected UART RX
// line.  A break is started when the function is called with \e bSend set to
// \b true and persists until the function is called again with \e bSend set
// to \b false.
//
//*****************************************************************************
static void
SendBreak(tBoolean bSend)
{
    //
    //C28x SCI cannot send break conditions
    //
    return;
}

//*****************************************************************************
//
// Handles CDC driver notifications related to control and setup of the device.
//
// \param pvCBData is the client-supplied callback pointer for this channel.
// \param ui32Event identifies the notification event.
// \param ui32MsgValue is an event-specific value.
// \param pvMsgData is an event-specific pointer.
//
// This function is called by the CDC driver to perform control-related
// operations on behalf of the USB host.  These functions include setting
// and querying the serial communication parameters, setting handshake line
// states and sending break conditions.
//
// \return The return value is event-specific.
//
//*****************************************************************************
unsigned long
ControlHandler(void *pvCBData, uint32_t ui32Event, uint32_t ui32MsgValue,
               void *pvMsgData)
{
    //
    // Which event was sent?
    //
    switch(ui32Event)
    {
        //
        // The host has connected.
        //
    case USB_EVENT_CONNECTED:
    {
        //
        // Flush the buffers.
        //
        USBBufferFlush(&g_sTxBuffer);
        USBBufferFlush(&g_sRxBuffer);

        break;
    }

    //
    // The host has disconnected.
    //
    case USB_EVENT_DISCONNECTED:
    {
        break;
    }

    //
    // Return the current serial communication parameters.
    //
    case USBD_CDC_EVENT_GET_LINE_CODING:
    {
        GetLineCoding(pvMsgData);
        break;
    }

    //
    // Set the current serial communication parameters.
    //
    case USBD_CDC_EVENT_SET_LINE_CODING:
    {
        SetLineCoding(pvMsgData);
        break;
    }

    //
    // Set the current serial communication parameters.
    //
    case USBD_CDC_EVENT_SET_CONTROL_LINE_STATE:
    {
        break;
    }

    //
    // Send a break condition on the serial line.
    //
    case USBD_CDC_EVENT_SEND_BREAK:
    {
        SendBreak(true);
        break;
    }

    //
    // Clear the break condition on the serial line.
    //
    case USBD_CDC_EVENT_CLEAR_BREAK:
    {
        SendBreak(false);
        break;
    }

    //
    // Ignore SUSPEND and RESUME for now.
    //
    case USB_EVENT_SUSPEND:
    case USB_EVENT_RESUME:
    {
        break;
    }

    //
    // Other events can be safely ignored.
    //
    default:
    {
        break;
    }
    }

    return(0);
}

//*****************************************************************************
//
// Handles CDC driver notifications related to the transmit channel (data to
// the USB host).
//
// \param ui32CBData is the client-supplied callback pointer for this channel.
// \param ui32Event identifies the notification event.
// \param ui32MsgValue is an event-specific value.
// \param pvMsgData is an event-specific pointer.
//
// This function is called by the CDC driver to notify us of any events
// related to operation of the transmit data channel (the IN channel carrying
// data to the USB host).
//
// \return The return value is event-specific.
//
//*****************************************************************************
unsigned long
TxHandler(void *pvCBData, uint32_t ui32Event, uint32_t ui32MsgValue,
          void *pvMsgData)
{
    //
    // Which event was sent?
    //
    switch(ui32Event)
    {
    case USB_EVENT_TX_COMPLETE:
    {
        //
        // There is nothing to do here since it is handled by the
        // USBBuffer.
        //
        break;
    }

    //
    // Other events can be safely ignored.
    //
    default:
    {
        break;
    }
    }

    return(0);
}

//*****************************************************************************
//
// Handles CDC driver notifications related to the receive channel (data from
// the USB host).
//
// \param ui32CBData is the client-supplied callback data value for this channel.
// \param ui32Event identifies the notification event.
// \param ui32MsgValue is an event-specific value.
// \param pvMsgData is an event-specific pointer.
//
// This function is called by the CDC driver to notify us of any events
// related to operation of the receive data channel (the OUT channel carrying
// data from the USB host).
//
// \return The return value is event-specific.
//
//*****************************************************************************
unsigned long
RxHandler(void *pvCBData, uint32_t ui32Event, uint32_t ui32MsgValue,
          void *pvMsgData)
{
    uint32_t ui32Count;

    //
    // Which event was sent?
    //
    switch(ui32Event)
    {
        //
        // A new packet has been received.
        //
    case USB_EVENT_RX_AVAILABLE:
    {
        //
        // Feed some characters into the UART TX FIFO and enable the
        // interrupt.
        //
        USBUARTPrimeTransmit();
        UARTIntEnable(UART0_BASE, UART_INT_TXRDY);
        break;
    }

    //
    // This is a request for how much unprocessed data is still waiting to
    // be processed.  Return 0 if the UART is currently idle or 1 if it is
    // in the process of transmitting something.  The actual number of
    // bytes in the UART FIFO is not important here, merely whether or
    // not everything previously sent to us has been transmitted.
    //
    case USB_EVENT_DATA_REMAINING:
    {
        //
        // Get the number of bytes in the buffer and add 1 if some data
        // still has to clear the transmitter.
        //
        ui32Count = UARTBusy(UART0_BASE) ? 1 : 0;
        return(ui32Count);
    }

    //
    // This is a request for a buffer into which the next packet can be
    // read.  This mode of receiving data is not supported so let the
    // driver know by returning 0.  The CDC driver should not be sending
    // this message but this is included just for illustration and
    // completeness.
    //
    case USB_EVENT_REQUEST_BUFFER:
    {
        return(0);
    }

    //
    // Other events can be safely ignored.
    //
    default:
    {
        break;
    }
    }

    return(0);
}


void SysCtrlInit(void)
{

    EALLOW;
    //Disable Watchdog
    SysCtrlRegs.WDCR = 0x68;

    //Setup Clock
    //20MHz ->PLL->80MHz->C28
    //      ->PLL2->120MHz->USB
    SysCtrlRegs.CLKCTL.bit.XCLKINOFF = 1;
    SysCtrlRegs.CLKCTL.bit.XTALOSCOFF = 0;
    SysCtrlRegs.CLKCTL.bit.OSCCLKSRC2SEL = 0;
    SysCtrlRegs.CLKCTL.bit.OSCCLKSRCSEL = 1;

